{
  "movies": [
    {
      "id": 1,
      "title": "Красавица для чудовища",
      "year": 2017,
      "genre": "Драма, мелодрама, биография, история",
      "rating": 6.7,
      "description": "Когда тебе 16 лет и ты влюбляешься, можешь ли ты представить, что жизнь подарит тебе монстра?",
      "poster": "/posters/krasavitsa.webp"
    },
    {
      "id": 2,
      "title": "Остров проклятых",
      "year": 2009,
      "genre": "Триллер, детектив, драма",
      "rating": 8.6,
      "description": "Два американских судебных пристава отправляются на один из островов в штате Массачусетс, чтобы расследовать исчезновение пациентки клиники для умалишенных преступников. При проведении расследования им придется столкнуться с паутиной лжи, обрушившимся ураганом и смертельным бунтом обитателей клиники.",
      "poster": "/posters/ostrov.jpeg"
    },
    {
      "id": 3,
      "title": "Интерстеллар",
      "year": 2014,
      "genre": "Фантастика, Драма",
      "rating": 8.7,
      "description": "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
      "poster": "/posters/interstellar.webp"
    },
    {
      "id": 4,
      "title": "Зеленая книга",
      "year": 2018,
      "genre": "Комедия, биография",
      "rating": 8.5,
      "description": "1960-е годы. После закрытия нью-йоркского ночного клуба на ремонт вышибала Тони по прозвищу Болтун ищет подработку на пару месяцев. Как раз в это время Дон Ширли — утонченный светский лев, богатый и талантливый чернокожий музыкант, исполняющий классическую музыку — собирается в турне по южным штатам, где ещё сильны расистские убеждения и царит сегрегация. Он нанимает Тони в качестве водителя, телохранителя и человека, способного решать текущие проблемы. У этих двоих так мало общего, и эта поездка навсегда изменит жизнь обоих..",
      "poster": "/posters/green_book.webp"
    },
    {
      "id": 5,
      "title": "Унесенные призраками",
      "year": 2001,
      "genre": "Аниме, фентези",
      "rating": 8.6,
      "description": "Тихиро с мамой и папой переезжает в новый дом. Заблудившись по дороге, они оказываются в странном пустынном городе, где их ждет великолепный пир. Родители с жадностью набрасываются на еду и к ужасу девочки превращаются в свиней, став пленниками злой колдуньи Юбабы. Теперь, оказавшись одна среди волшебных существ и загадочных видений, Тихиро должна придумать, как избавить своих родителей от чар коварной старухи.",
      "poster": "/posters/sen_to_chihiro.webp"
    },
    {
      "id": 6,
      "title": "Темный рыцарь",
      "year": 2008,
      "genre": "Драма, фантастика",
      "rating": 8.5,
      "description": "Бэтмен поднимает ставки в войне с криминалом. С помощью лейтенанта Джима Гордона и прокурора Харви Дента он намерен очистить улицы Готэма от преступности. Сотрудничество оказывается эффективным, но скоро они обнаружат себя посреди хаоса, развязанного восходящим криминальным гением, известным напуганным горожанам под именем Джокер.",
      "poster": "/posters/dark_knight.webp"
    },
    {
      "id": 7,
      "title": "Титаник",
      "year": 1997,
      "genre": "Мелодрамма, триллер",
      "rating": 8.4,
      "description": "Апрель 1912 года. В первом и последнем плавании шикарного «Титаника» встречаются двое. Пассажир нижней палубы Джек выиграл билет в карты, а богатая наследница Роза отправляется в Америку, чтобы выйти замуж по расчёту. Чувства молодых людей только успевают расцвести, и даже не классовые различия создадут испытания влюблённым, а айсберг, вставший на пути считавшегося непотопляемым лайнера.",
      "poster": "/posters/Titanic.webp"
    },
    {
      "id": 8,
      "title": "Гарри Поттер и философский камень",
      "year": 2001,
      "genre": "Фэнтези, приключения",
      "rating": 8.3,
      "description": "Жизнь десятилетнего Гарри Поттера нельзя назвать сладкой: родители умерли, едва ему исполнился год, а от дяди и тёти, взявших сироту на воспитание, достаются лишь тычки да подзатыльники. Но в одиннадцатый день рождения Гарри всё меняется. Странный гость, неожиданно появившийся на пороге, приносит письмо, из которого мальчик узнаёт, что на самом деле он - волшебник и зачислен в школу магии под названием Хогвартс. А уже через пару недель Гарри будет мчаться в поезде Хогвартс-экспресс навстречу новой жизни, где его ждут невероятные приключения, верные друзья и самое главное — ключ к разгадке тайны смерти его родителей.",
      "poster": "/posters/Harry1.webp"
    },
    {
      "id": 9,
      "title": "Гарри Поттер и Тайная комната",
      "year": 2002,
      "genre": "Фэнтези, приключения",
      "rating": 8.2,
      "description": "Гарри Поттер переходит на второй курс Школы чародейства и волшебства Хогвартс. Эльф Добби предупреждает Гарри об опасности, которая поджидает его там, и просит больше не возвращаться в школу.\n\nЮный волшебник не следует совету эльфа и становится свидетелем таинственных событий, разворачивающихся в Хогвартсе. Вскоре Гарри и его друзья узнают о существовании Тайной Комнаты и сталкиваются с новыми приключениями, пытаясь победить темные силы.",
      "poster": "/posters/Harry2.webp"
    },
    {
      "id": 10,
      "title": "Гарри Поттер и узник Азкабана",
      "year": 2004,
      "genre": "Фэнтези, приключения",
      "rating": 8.3,
      "description": "Гарри, Рон и Гермиона возвращаются на третий курс школы чародейства и волшебства Хогвартс. На этот раз они должны раскрыть тайну узника, сбежавшего из тюрьмы Азкабан, чье пребывание на воле создает для Гарри смертельную опасность.",
      "poster": "/posters/Harry3.webp"
    },
    {
      "id": 11,
      "title": "Гарри Поттер и Кубок огня",
      "year": 2005,
      "genre": "Фэнтези, приключения",
      "rating": 8.0,
      "description": "Гарри Поттер, Рон и Гермиона возвращаются на четвёртый курс школы чародейства и волшебства Хогвартс. При таинственных обстоятельствах Гарри был отобран в число участников опасного соревнования — Турнира Трёх Волшебников, однако проблема в том, что все его соперники — намного старше и сильнее.\n\nК тому же, знаки указывают на возвращение Лорда Волдеморта. Вскоре Гарри предстоит побороться не только за победу в соревновании, но и за свою жизнь.",
      "poster": "/posters/Harry4.webp"
    },
    {
      "id": 12,
      "title": "Гарри Поттер и Орден Феникса",
      "year": 2007,
      "genre": "Фэнтези, приключения",
      "rating": 7.9,
      "description": "Гарри проводит свой пятый год в школе Хогвартс и обнаруживает, что многие из членов волшебного сообщества отрицают факт недавнего состязания юного волшебника с воплощением вселенского зла Волдемортом. Все делают вид, что не имеют ни малейшего представления, что злодей вернулся. Однако впереди волшебников ждет необычная схватка.",
      "poster": "/posters/Harry5.webp"
    },
    {
      "id": 13,
      "title": "Гарри Поттер и Принц-полукровка",
      "year": 2009,
      "genre": "Фэнтези, приключения",
      "rating": 7.9,
      "description": "Теперь не только мир волшебников, но и мир маглов ощущает на себе всевозрастающую силу Волан-де-Морта, а Хогвартс уже никак не назовешь надежным убежищем. Гарри подозревает, что в самом замке затаилась некая опасность, но Дамблдор больше сосредоточен на том, чтобы подготовить его к финальной схватке, которая, как он знает, уже не за горами. Вместе они пытаются разгадать секрет бессмертия Волан-де-Морта, а для этого Дамблдор приглашает на должность преподавателя по зельеварению своего старинного друга и коллегу — профессора Горация Слизнорта.",
      "poster": "/posters/Harry6.webp"
    },
    {
      "id": 14,
      "title": "Гарри Поттер и Дары Смерти: Часть I",
      "year": 2010,
      "genre": "Фэнтези, приключения",
      "rating": 7.9,
      "description": "Гарри Поттера ждёт самое страшное испытание в жизни — смертельная схватка с Волан-де-Мортом. Друзья и враги Гарри предстают в совершенно неожиданном свете. Граница между добром и злом становится всё призрачнее.",
      "poster": "/posters/Harry7.1.webp"
    },
    {
      "id": 15,
      "title": "Гарри Поттер и Дары Смерти: Часть II",
      "year": 2011,
      "genre": "Фэнтези, приключения",
      "rating": 8.2,
      "description": "Битва между добрыми и злыми силами мира волшебников перерастает во всеобщую войну. Ставки ещё никогда не были так высоки, а поиск убежища — столь сложен. И, быть может, именно Гарри Поттеру придется пожертвовать всем в финальном сражении с Волан-де-Мортом.",
      "poster": "/posters/Harry7.2.webp"
    },
    {
      "id": 16,
      "title": "Паразиты",
      "year": 2019,
      "genre": "Драма, триллер",
      "rating": 8.1,
      "description": "Обычное корейское семейство Кимов жизнь не балует. Приходится жить в сыром грязном полуподвале, воровать интернет у соседей и перебиваться случайными подработками. Однажды друг сына семейства, уезжая на стажировку за границу, предлагает тому заменить его и поработать репетитором у старшеклассницы в богатой семье Пак. Подделав диплом о высшем образовании, парень отправляется в шикарный дизайнерский особняк и производит на хозяйку дома хорошее впечатление. Тут же ему в голову приходит необычный план по трудоустройству сестры.",
      "poster": "/posters/parasites.webp"
    },
    {
      "id": 17,
      "title": "Адвокат Дьявола",
      "year": 1997,
      "genre": "Триллер, фэнтези, драма, детектив",
      "rating": 8.2,
      "description": "В Нью-Йорк по приглашению главы крупного юридического концерна прибывает Кевин Ломакс, молодой адвокат. До этого он был известен тем, что защищал исключительно негодяев и притом не проиграл ни одного процесса. На новом месте работы он вполне счастлив, он живет в роскошной квартире с любящей женой, его окружают интересные люди.",
      "poster": "/posters/devil.webp"
    },
    {
      "id": 18,
      "title": "Мстители: Война бесконечности",
      "year": 2018,
      "genre": "Фантастика, боевик, приключения",
      "rating": 8.1,
      "description": "Пока Мстители и их союзники продолжают защищать мир от различных опасностей, с которыми не смог бы справиться один супергерой, новая угроза возникает из космоса: Танос. Межгалактический тиран преследует цель собрать все шесть Камней Бесконечности — артефакты невероятной силы, с помощью которых можно менять реальность. Всё, с чем Мстители сталкивались ранее, вело к этому моменту — судьба Земли никогда ещё не была столь неопределённой.",
      "poster": "/posters/Avengers.webp"
    },
    {
      "id": 19,
      "title": "Один дома",
      "year": 1990,
      "genre": "Комедия, семейный",
      "rating": 8.3,
      "description": "Американское семейство отправляется из Чикаго в Европу, но в спешке сборов бестолковые родители забывают дома... одного из своих детей. Юное создание, однако, не теряется и демонстрирует чудеса изобретательности. И когда в дом залезают грабители, им приходится не раз пожалеть о встрече с милым крошкой.",
      "poster": "/posters/home_alone.webp"
    },
    {
      "id": 20,
      "title": "Молчание ягнят",
      "year": 1990,
      "genre": "Триллер, детектив, криминал, драма, ужасы",
      "rating": 8.3,
      "description": "Психопат похищает и убивает молодых женщин по всему Среднему Западу. ФБР, уверенное, что все преступления совершены одним и тем же человеком, поручает агенту Клариссе Старлинг встретиться с заключенным-маньяком Ганнибалом Лектером, который мог бы помочь составить психологический портрет убийцы. Сам Лектер отбывает наказание за убийства и каннибализм. Он согласен помочь Клариссе лишь в том случае, если она попотчует его больное воображение подробностями своей личной жизни.",
      "poster": "/posters/silence.webp"
    },
    {
      "id": 21,
      "title": "Железный человек",
      "year": 2008,
      "genre": "Фантастика, боевик, приключения",
      "rating": 8.0,
      "description": "Миллиардер-изобретатель Тони Старк попадает в плен к Афганским террористам, которые пытаются заставить его создать оружие массового поражения. В тайне от своих захватчиков Старк конструирует высокотехнологичную киберброню, которая помогает ему сбежать. Однако по возвращении в США он узнаёт, что в совете директоров его фирмы плетётся заговор, чреватый страшными последствиями. Используя своё последнее изобретение, Старк пытается решить проблемы своей компании радикально...",
      "poster": "/posters/iron_man.webp"
    },
    {
      "id": 22,
      "title": "Гордость и предубеждение",
      "year": 2005,
      "genre": "Драма, мелодрама",
      "rating": 8.2,
      "description": "Англия, конец XVIII века. Родители пятерых сестер Беннет озабочены тем, чтобы удачно выдать дочерей замуж. И потому размеренная жизнь солидного семейства переворачивается вверх дном, когда по соседству появляется молодой джентльмен - мистер Бингли...\n\n\nСамо собой, среди друзей нового соседа оказывается немало утонченных аристократов, которые не прочь поухаживать за очаровательными сестрами. Однако, все не так просто. Своевольная Элизабет знакомится с другом Бингли - красивым и высокомерным мистером Дарси, и между ними разгорается нешуточное противостояние, результатом которого может стать как любовь, так и ненависть...",
      "poster": "/posters/pride.webp"
    },
    {
      "id": 23,
      "title": "Иллюзия обмана",
      "year": 2013,
      "genre": "Криминал, триллер, детектив",
      "rating": 7.8,
      "description": "Команда лучших иллюзионистов мира проворачивает дерзкие ограбления прямо во время своих шоу, играя в кошки-мышки с агентами ФБР.",
      "poster": "/posters/now_you_see_me.webp"
    },
    {
      "id": 24,
      "title": "Иллюзия обмана 2",
      "year": 2016,
      "genre": "Боевик, триллер, комедия, криминал, детектив, приключения",
      "rating": 6.9,
      "description": "«Четыре всадника», команда лучших иллюзионистов мира, возвращается в дело спустя год после побега от ФБР. Им предстоит спасти свою репутацию и вывести на чистую воду жестокого руководителя технологической корпорации.",
      "poster": "/posters/now_you_see_me2.webp"
    },
    {
      "id": 25,
      "title": "Джокер",
      "year": 2019,
      "genre": "Драма, криминал, триллер",
      "rating": 8.0,
      "description": "Готэм, начало 1980-х годов. Комик Артур Флек живет с больной матерью, которая с детства учит его «ходить с улыбкой». Пытаясь нести в мир хорошее и дарить людям радость, Артур сталкивается с человеческой жестокостью и постепенно приходит к выводу, что этот мир получит от него не добрую улыбку, а ухмылку злодея Джокера.",
      "poster": "/posters/joker.webp"
    },
    {
      "id": 26,
      "title": "Вечное сияние чистого разума",
      "year": 2004,
      "genre": "Мелодрама, фантастика, драма",
      "rating": 8.0,
      "description": "Застенчивый и меланхоличный Джоэл живёт ничем не примечательной серой и унылой жизнью. Но однажды вместо привычного рабочего маршрута молодой человек вдруг садится на электричку в другом направлении и устремляется к морю. На песчаном берегу Джоэл замечает девушку с ярко-синими волосами. На обратном пути они знакомятся в вагоне электрички и парень понимает, что у них с Клементиной очень много общего, как будто он уже знает эту девушку. Совсем скоро Джоэл поймёт, что действительно был знаком с ней, более того - они были парой.",
      "poster": "/posters/spotless_mind.webp"
    },
    {
      "id": 27,
      "title": "Константин: Повелитель тьмы",
      "year": 2005,
      "genre": "Фэнтези, ужасы, боевик, детектив",
      "rating": 7.9,
      "description": "Джону Константину удалось не только побывать в аду, но и вернуться обратно. Родившись с неугодным самому себе талантом — способностью распознавать помесь ангелов и демонов, которые бродят по земле в облике людей, — Константин под давлением обстоятельств пытается совершить самоубийство, лишь бы избавиться от мучительных видений. Но неудачно. Воскрешенный против собственной воли он снова оказывается в мире живых. Теперь, отмеченный печатью суицида и получивший временное право на жизнь, он патрулирует границу, разделяющую рай и ад, тщетно надеясь на обретение спасения путем сражения с земными ставленниками зла.",
      "poster": "/posters/constantine.webp"
    },
    {
      "id": 28,
      "title": "Люди в чёрном",
      "year": 1997,
      "genre": "Фантастика, боевик, комедия, приключения",
      "rating": 8.0,
      "description": "Они - самый большой секрет Земли. Они работают на неофициальное правительственное агентство, регулирующее деятельность инопланетян на Земле.\n\nОни - это лучшая, последняя и единственная линия защиты Земли от отбросов вселенной. Их работа секретна, их оружие совершенно, им нет равных, они не оставляют следов. Они - это Люди в черном.",
      "poster": "/posters/MIB.webp"
    },
    {
      "id": 29,
      "title": "Люди в чёрном 2",
      "year": 2002,
      "genre": "Фантастика, боевик, комедия, детектив, приключения",
      "rating": 7.3,
      "description": "Много лет назад лучший агент организации «Люди в черном» Кей получил задание особой важности. Ему поручили надёжно спрятать таинственный космический артефакт «Светоч». Проходит 25 лет и на Землю прилетает уничтожительница миров Серлина. Приняв образ сексапильной фотомодели, она начала поиски «Светоча». Чтобы не дать ни единого шанса Серлине артефакт нужно отыскать раньше неё, но есть одна проблема - после того как агенты Кей и Джей уничтожили четыре года назад хищного инопланетного таракана, Кею стёрли память. Теперь он мирно трудится в Почтовом департаменте. У него нет даже малейшего воспоминания о своём прошлом, и Джею, для спасения мира, во чтобы то ни стало нужно найти способ восстановить его память.",
      "poster": "/posters/MIB2.webp"
    },
    {
      "id": 30,
      "title": "Люди в чёрном 3",
      "year": 2012,
      "genre": "Фантастика, боевик, комедия, приключения",
      "rating": 7.2,
      "description": "Агент Джей узнает, что никакого защитного галактического щита, способного отразить иноземный удар, не существует. Агент Кей не построил его, потому что был убит в 1969 году. Агент Джей должен совершить путешествие во времени, чтобы спасти Землю и жизнь напарника.",
      "poster": "/posters/MIB3.webp"
    }
  ]
}